{
  "backend/main.mo": "Empty Motoko actor with no functionality.",
  "feature_evidence.json": "Feature evidence report listing two frontend modifications related to removing a CTA button and updating accompanying text.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend component, hook, and utility module.",
  "frontend/index.css": "Tailwind base/theme configuration defining light/dark color variables and applying global background and text styles.",
  "frontend/index.html": "Basic HTML entry point loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Root React component toggling between tester and about views inside the site layout.",
  "frontend/src/components/gamepad/AnalogCalibrationPanel.tsx": "Panel allowing adjustment of joystick dead zones with live raw/calibrated axis readouts and controller-specific support checks.",
  "frontend/src/components/gamepad/AxesVisualizer.tsx": "Visualizes each axis value with animated bars, active indicators, and empty-state handling.",
  "frontend/src/components/gamepad/ButtonGrid.tsx": "Renders a grid of buttons showing pressed, touched, and value states with animated feedback.",
  "frontend/src/components/gamepad/ButtonHeatmapPanel.tsx": "Tracks and displays per-button press counts as a heatmap with reset functionality and intensity-based coloring.",
  "frontend/src/components/gamepad/ControllerTabs.tsx": "Renders controller selection tabs, showing a single controller label or multiple tab triggers based on the connected gamepads.",
  "frontend/src/components/gamepad/DriftTestPanel.tsx": "Captures and charts joystick axis drift over time, allowing start, stop, and reset of drift data collection.",
  "frontend/src/components/gamepad/GyroImuPanel.tsx": "Displays motion sensor orientation data by drawing a rotating 3D cube when supported by the connected controller.",
  "frontend/src/components/gamepad/LatencyTestPanel.tsx": "Runs a latency reaction test by timing button presses after a random delay and tracking recent latency stats.",
  "frontend/src/components/gamepad/TesterPostContent.tsx": "Shows SEO content, FAQs, and a list of supported gamepads as part of the tester's informational section.",
  "frontend/src/components/gamepad/TesterSeoContentBlock.tsx": "Provides detailed marketing and instructional text explaining features and usage of the gamepad tester tool.",
  "frontend/src/components/gamepad/VibrationTestPanel.tsx": "UI panel for testing gamepad vibration with intensity control and support for multiple haptic APIs.",
  "frontend/src/components/gamepad/WaitingForControllerAnimation.tsx": "Displays animated visuals and messaging while waiting for a controller to connect.",
  "frontend/src/components/SiteLayout.tsx": "Layout wrapper with header, navigation buttons, main content slot, and footer.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the current Internet Identity, refetching dependent queries when it changes.",
  "frontend/src/hooks/useGamepads.ts": "Polls and tracks connected gamepads, auto-selecting and updating the active controller.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth state, login/logout handling, and persistence via a React context.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file noting backend has no query methods.",
  "frontend/src/index.css": "Tailwind base styles with custom color variables, themes, and utility classes.",
  "frontend/src/lib/analogCalibration.ts": "Applies dead zone calibration to gamepad analog axes and provides related helpers and types.",
  "frontend/src/lib/controllerDetection.ts": "Detects controller type from gamepad ID and returns standardized controller info.",
  "frontend/src/main.tsx": "Application entry point initializing React, Internet Identity provider, and React Query.",
  "frontend/src/pages/AboutPage.tsx": "Static About page showing feature highlights and instructions for using the gamepad tester.",
  "frontend/src/pages/TesterPage.tsx": "Main tester interface that manages gamepad detection, controller selection, and renders various diagnostic panels with calibration handling.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, and utilities, and enabling typography, container queries, and animation plugins.",
  "project_state.json": "Project metadata describing current features, requirements, architecture notes, and development state for the gamepad tester."
}