{
  "backend/main.mo": "Empty Motoko actor with no logic implemented.",
  "feature_evidence.json": "Defines feature evidence entries describing required updates to frontend/index.html, including AdSense, Clarity, metadata, and placeholder cleanup.",
  "frontend-file-summaries.txt": "Text file mapping frontend source paths to short functional descriptions used for build planning.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color variables for light/dark themes and applying global background and text styles.",
  "frontend/index.html": "Main HTML entry including metadata, AdSense script, Microsoft Clarity script, and the root mount for the React app.",
  "frontend/src/App.tsx": "Root React component routing between the tester and about pages using internal state.",
  "frontend/src/components/gamepad/AnalogCalibrationPanel.tsx": "UI panel for adjusting joystick dead zones with live raw/calibrated values and controller-specific support checks.",
  "frontend/src/components/gamepad/AxesVisualizer.tsx": "Visualizes controller axis values with animated bars and active-state indicators.",
  "frontend/src/components/gamepad/ButtonGrid.tsx": "Displays a grid of buttons showing pressed/touched states with percentage values and visual highlights.",
  "frontend/src/components/gamepad/ButtonHeatmapPanel.tsx": "Tracks button press counts and displays them as a heatmap with color intensity and a reset option.",
  "frontend/src/components/gamepad/ControllerTabs.tsx": "Renders tabs or a label for selecting among connected controllers using detected controller names.",
  "frontend/src/components/gamepad/DriftTestPanel.tsx": "Captures and charts joystick axis drift over time, with controls to start, stop, and reset data collection.",
  "frontend/src/components/gamepad/GyroImuPanel.tsx": "Reads motion/orientation data from a controller and visualizes it by rendering a 3D rotating cube on a canvas.",
  "frontend/src/components/gamepad/LatencyTestPanel.tsx": "Runs a reaction-style latency test by timing button press response and tracking history with basic stats.",
  "frontend/src/components/gamepad/TesterFeaturesSection.tsx": "Displays a grid of feature descriptions with icons explaining the tool’s capabilities.",
  "frontend/src/components/gamepad/TesterHowToTestSection.tsx": "Shows a step-by-step guide with icons explaining how to connect and test a gamepad.",
  "frontend/src/components/gamepad/TesterPostContent.tsx": "Aggregates SEO, features, how-to, FAQ, and supported gamepad list sections into a single page layout.",
  "frontend/src/components/gamepad/TesterSeoContentBlock.tsx": "Displays SEO-focused marketing content explaining features, usage, and supported controllers for the tester.",
  "frontend/src/components/gamepad/VibrationTestPanel.tsx": "Provides UI and logic to test controller vibration using available Gamepad API haptic actuators.",
  "frontend/src/components/gamepad/WaitingForControllerAnimation.tsx": "Shows an animated waiting screen prompting users to connect a controller.",
  "frontend/src/components/SiteLayout.tsx": "Site-wide layout providing header navigation, main content area, and footer with external link.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity and invalidates dependent queries when identity changes.",
  "frontend/src/hooks/useGamepads.ts": "Polls the Gamepad API to track connected controllers, auto-selects one, and updates state on connect/disconnect.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for managing Internet Identity authentication, including login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file noting that backend methods are unused and gamepad features are client-side.",
  "frontend/src/index.css": "Sets Tailwind layers plus OKLCH theme variables for light/dark mode and defines utility classes and animations.",
  "frontend/src/lib/analogCalibration.ts": "Implements dead‑zone calibration for analog stick axes and exports default calibration settings.",
  "frontend/src/lib/controllerDetection.ts": "Detects controller type from gamepad ID and returns metadata including supported features.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity provider and loads global styles.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with feature descriptions, usage steps, and styled icon sections.",
  "frontend/src/pages/TesterPage.tsx": "Main testing UI that shows connection status, controller tabs, detection info, and multiple diagnostic panels with per‑controller calibration state.",
  "frontend/tailwind.config.js": "Configures Tailwind with OKLCH color variables, custom animations, container settings, and plugins.",
  "project_state.json": "Project metadata describing current features, issues, architecture notes, and required integration fixes."
}