{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Replace placeholder AdSense/Clarity IDs and update HTML metadata",
  "requirements": [
    {
      "id": "REQ-30",
      "summary": "Replace placeholder Google AdSense client in frontend/index.html with the provided production AdSense script URL/client while keeping async + safe-failure behavior.",
      "acceptanceCriteria": [
        "frontend/index.html includes the AdSense script tag with src exactly set to: https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js?client=ca-pub-6270014025121224",
        "The placeholder string \"ca-pub-XXXXXXXXXXXXXXXX\" no longer appears anywhere in frontend/index.html",
        "The script remains async-loaded and does not prevent the SPA from rendering if blocked or failing to load (e.g., onerror handler or equivalent safe failure behavior is present)."
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Update the Google AdSense script tag to use src exactly https://pagead2.googlesyndication.com/pagead/js/adsbygoogle.js?client=ca-pub-6270014025121224; remove any remaining placeholder client string; preserve async loading and ensure safe failure behavior remains (e.g., keep/ensure an onerror handler so rendering is not blocked)."
        }
      ]
    },
    {
      "id": "REQ-31",
      "summary": "Replace placeholder Microsoft Clarity project ID in frontend/index.html with the provided production project ID while keeping non-blocking load.",
      "acceptanceCriteria": [
        "The Clarity snippet in frontend/index.html uses the project ID exactly: nv7n4ru8tf",
        "The placeholder string \"CLARITY_PROJECT_ID\" no longer appears anywhere in frontend/index.html",
        "The Clarity snippet loads asynchronously and does not block initial app render."
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Update the Microsoft Clarity snippet to use the project ID exactly nv7n4ru8tf; remove the placeholder string; keep the snippet’s async script insertion so it does not block initial render."
        }
      ]
    },
    {
      "id": "REQ-32",
      "summary": "Update frontend/index.html title and meta description to the exact required production values.",
      "acceptanceCriteria": [
        "The <title> in frontend/index.html is exactly: \"Gamepad Tester Online – Check Controller Buttons, Joysticks & Vibration\"",
        "frontend/index.html includes a meta name=\"description\" tag with content exactly: \"Free online gamepad tester to check controller buttons, sticks, triggers, vibration and gyroscope. Works with Xbox, PS and USB controllers.\"",
        "After these changes, no outdated/previous title text remains in frontend/index.html."
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Set the document <title> exactly to \"Gamepad Tester Online – Check Controller Buttons, Joysticks & Vibration\" and add/update a meta name=\"description\" with content exactly \"Free online gamepad tester to check controller buttons, sticks, triggers, vibration and gyroscope. Works with Xbox, PS and USB controllers.\"; remove any outdated title/description text remaining in the file."
        }
      ]
    },
    {
      "id": "REQ-33",
      "summary": "Remove or update placeholder replacement comments in frontend/index.html so production IDs are not presented as placeholders.",
      "acceptanceCriteria": [
        "frontend/index.html does not contain the placeholder-replacement comments that reference \"Replace ca-pub-XXXXXXXXXXXXXXXX\" and/or \"Replace CLARITY_PROJECT_ID\"",
        "The production AdSense client and Clarity project ID remain present and correct after comment cleanup."
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Delete or rewrite placeholder guidance/comments that instruct replacing IDs (e.g., comments referencing \"Replace ca-pub-XXXXXXXXXXXXXXXX\" and/or \"Replace CLARITY_PROJECT_ID\"), ensuring the finalized production AdSense client and Clarity project ID remain present and correct."
        }
      ]
    }
  ]
}